BACKEND-RigAssist/app/controllers/animations_controller.rb

    def index
        render json: Animation.all
---
SELECT "animations".* FROM "animations"

    def create
        animation = Animation.create(params[:animation])
---
INSERT INTO "animations" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2019-11-13 15:47:42.168851"], ["updated_at", "2019-11-13 15:47:42.168851"]]