BACKEND-RigAssist/app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"
---
    def index
        render json: Project.all